# -----------------------------
# Базовый образ
# -----------------------------
FROM python:3.12-slim

# -----------------------------
# Рабочая директория
# -----------------------------
WORKDIR /app

# -----------------------------
# Обновление pip и установка зависимостей
# -----------------------------
RUN pip install --no-cache-dir --upgrade pip

RUN pip install --no-cache-dir \
    torch \
    flask \
    flask-cors \
    soundfile \
    requests \
    websockets==12.0 \
    gunicorn

# -----------------------------
# Копируем проект
# -----------------------------
COPY . .

# -----------------------------
# Создаём временную директорию для TTS
# -----------------------------
RUN mkdir -p tts_temp

# -----------------------------
# Порты
# -----------------------------
EXPOSE 5001
EXPOSE 6789

# -----------------------------
# Запуск сервера
# -----------------------------
# Используем python для запуска main скрипта, чтобы одновременно работал Flask и WebSocket
CMD ["python", "-u", "server.py"]
