# -----------------------------
# Базовый образ
# -----------------------------
FROM python:3.12-slim

# -----------------------------
# Рабочая директория
# -----------------------------
WORKDIR /app

# -----------------------------
# Python-зависимости
# -----------------------------
RUN pip install --no-cache-dir \
    torch \
    gunicorn \
    flask \
    flask-cors \
    soundfile \
    requests

# -----------------------------
# Копируем проект
# -----------------------------
COPY . .

# -----------------------------
# Порт
# -----------------------------
EXPOSE 5001

# -----------------------------
# Запуск Gunicorn
# -----------------------------
CMD ["gunicorn", "-w", "1", "-b", "0.0.0.0:5001", "--timeout", "120", "--max-requests", "50", "--max-requests-jitter", "10", "server:app"]
